package org.javaacademy.module2.homework.Homework1.ex3;

/*Создать класс Item - с единственным атрибутом - имя вещи.
Склад принимает в себя вещи. У склада нет ограничений в хранении.
Склад умеет принимать в себя список вещей и хранить их с уже существующими вещами.
В складе должен быть метод: получить все вещи. Данный метод вернет список, в котором будет только каждая четная вещь из склада.
В складе должен быть метод: получить вещь по индексу. Данная вещь пропадает из склада.
Склад умеет удалять все вещи, кроме последней.*/
public class Runner {
    public static void main(String[] args) {

    }
}
