package org.javaacademy.module2.homework.homework4.ex3;

/**Задание №3 - Небоскребы, небоскребы, а я...
Дано: Небоскреб - имя небоскреба, его высота в метрах.
Необходимо создать небоскребы:
1 Всемирный торговый центр 1 - 541м
2 Шанхайская башня - 632м
3	Бурдж-Халифа - 828м
4 Международный финансовый центр Пинань - 599м
5 Абрадж аль-Бейт - 601м
6 Всемирный центр Лотте - 555м

Занести данный список в List! Дважды положить бурдж халифа в лист.
С помощью стримов:
Убрать дубликаты
(РАЗНЫЕ СТРИМЫ)
Вывести только первые три небоскреба.
Вывести самый высокий небоскреб.
Вывести те небоскребы, которые выше километра.
Если выше нет, то вывести на экран: небоскреба выше километра - нет.*/
public class Runner {
    public static void main(String[] args) {

    }
}
