package org.javaacademy.module2.homework.homework4.ex2;

import java.util.List;

/**Задание №2 - Сколько здесь "о" ?
Создать набор уникальных слов: "тонь", "тополь", "боль", "рой", "стройка"
Внутри одного стрима:
Посчитать количество букв "о" в одном слове
Посчитать сумму количества букв "о" во всех словах из набора
Если буквы "о" есть - напечатать количество букв "о", если нет выкинуть исключение
ожидаемый результат:
 6*/
public class Runner {
    public static void main(String[] args) {
        List<String> listString = List.of("тонь", "тополь", "боль", "рой", "стройка");
//        listString.stream().
    }
}
